; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	infrared0 - mode
	spectrograph7 - mode
	image2 - mode
	spectrograph3 - mode
	thermograph6 - mode
	image4 - mode
	thermograph1 - mode
	infrared5 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image4)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph7)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image2)
	(supports instrument4 spectrograph7)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph7)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument6 infrared5)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph7)
	(supports instrument7 infrared5)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 infrared5)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared0)
	(supports instrument9 infrared5)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument10 infrared0)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 infrared5)
	(supports instrument11 image4)
	(calibration_target instrument11 Star4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite2 Phenomenon5)
	(pointing satellite3 GroundStation1)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 image4)
	(have_image Planet6 image2)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph6)
))

)

; plan
1. (turn_to satellite4 groundstation1 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 10
3. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 10
4. (turn_to satellite4 phenomenon8 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite4 phenomenon8 instrument10 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite4 phenomenon5 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 10
7. (turn_to satellite3 groundstation1 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon5)
   goals met: 3 of 10
9. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 10
10. (take_image satellite4 phenomenon5 instrument10 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 4 of 10
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
12. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 10
13. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
14. (take_image satellite0 phenomenon8 instrument1 image2)
   added: (have_image phenomenon8 image2)
   goals met: 5 of 10
15. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 5 of 10
16. (take_image satellite0 planet6 instrument1 image2)
   added: (have_image planet6 image2)
   goals met: 6 of 10
17. (take_image satellite0 planet6 instrument1 image4)
   added: (have_image planet6 image4)
   goals met: 7 of 10
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 10
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 10
20. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   goals met: 7 of 10
21. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 7 of 10
22. (turn_to satellite0 planet9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet9)
   goals met: 8 of 10
23. (take_image satellite0 planet9 instrument2 thermograph6)
   added: (have_image planet9 thermograph6)
   goals met: 9 of 10
24. (turn_to satellite4 star7 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star7)
   goals met: 9 of 10
25. (take_image satellite4 star7 instrument10 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 10 of 10
